tutorials/cem_toyARC_solidNodes/fluid-openfoam/system/controlDict_nonPrecice
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     cemFFHTFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.0001;

writeControl    runTime;

writeInterval   0.001;

purgeWrite      10;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

