tutorials/cem_toyARC_solidNodes/fluid-openfoam/system/controlDict_var
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     	cemFFHTFoam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	1;

deltaT          	0.001; //2.5e-07;

writeControl    	adjustableRunTime;

writeInterval   	0.001;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	12;

writeCompression 	off;

timeFormat      	general;

timePrecision   	12;

runTimeModifiable 	true;

adjustTimeStep  	yes;

maxCo			0.1;

maxDeltaT		0.01;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
