tutorials/cem_toyARC_solidNodes/fluid-openfoam/system/blockMeshDict_6blocks
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
	//Block-1 outlet	
	(0.09 0.00 0.00)
	(0.11 0.00 0.00)
	(0.11 0.01 0.00)
	(0.09 0.01 0.00)
        (0.09 0.00 0.01)
        (0.11 0.00 0.01)
        (0.11 0.01 0.01)
        (0.09 0.01 0.01)

	//Block-2 lower horz
        (0.01 0.01 0.00)
        (0.19 0.01 0.00)
        (0.19 0.02 0.00)
        (0.01 0.02 0.00)
        (0.01 0.01 0.01)
        (0.19 0.01 0.01)
        (0.19 0.02 0.01)
        (0.01 0.02 0.01)

	//Block-3 left vertical channel
        (0.01 0.02 0.00)
        (0.02 0.02 0.00)
        (0.02 0.18 0.00)
        (0.01 0.18 0.00)
        (0.01 0.02 0.01)
        (0.02 0.02 0.01)
        (0.02 0.18 0.01)
        (0.01 0.18 0.01)

	//Block-4 right vertical channel
        (0.18 0.02 0.00)
        (0.19 0.02 0.00)
        (0.19 0.18 0.00)
        (0.18 0.18 0.00)
        (0.18 0.02 0.01)
        (0.19 0.02 0.01)
        (0.19 0.18 0.01)
        (0.18 0.18 0.01)

        //Block-5 upper horz 
        (0.01 0.18 0.00)
        (0.19 0.18 0.00)
        (0.19 0.19 0.00)
        (0.01 0.19 0.00)
        (0.01 0.18 0.01)
        (0.19 0.18 0.01)
        (0.19 0.19 0.01)
        (0.01 0.19 0.01)

	//Block-6 inlet
        (0.09 0.19 0.00)
        (0.11 0.19 0.00)
        (0.11 0.20 0.00)
        (0.09 0.20 0.00)
        (0.09 0.19 0.01)
        (0.11 0.19 0.01)
        (0.11 0.20 0.01)
        (0.09 0.20 0.01)
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) ( 20  10 1) simpleGrading (1 1 1)
    hex ( 8  9 10 11 12 13 14 15) (180  10 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) ( 10 160 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) ( 10 160 1) simpleGrading (1 1 1)
    hex (32 33 34 35 36 37 38 39) (180  10 1) simpleGrading (1 1 1)
    hex (40 41 42 43 44 45 46 47) ( 20  10 1) simpleGrading (1 1 1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (41 40 44 45)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 0 4 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            ( 2  1  5  6)
	    ( 0  3  7  4)
	    (40 43 47 44)
	    (42 41 45 46)
        );
    }

    intf_outer
    {
        type wall;
        faces
        (
            ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
        );
    }

    intf_inner
    {
        type wall;
        faces
        (
            ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
	    ()
        );
    }
);
