tutorials/cem_toyARC_solidNodes/fluid-openfoam/system/blockMeshDict_finallyWorking
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2112;
    format      ascii;
    class       dictionary;
    location    system;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	//Block-1 outlet	
	(0.09 0.00 0.00)
	(0.11 0.00 0.00)
	(0.11 0.01 0.00)
	(0.09 0.01 0.00)
        (0.09 0.00 0.01)
        (0.11 0.00 0.01)
        (0.11 0.01 0.01)
        (0.09 0.01 0.01)

	//Block-2 lower horz
        (0.01 0.01 0.00)
        (0.19 0.01 0.00)
        (0.19 0.02 0.00)
        (0.01 0.02 0.00)
        (0.01 0.01 0.01)
        (0.19 0.01 0.01)
        (0.19 0.02 0.01)
        (0.01 0.02 0.01)

	//Block-3 left vertical channel
        (0.01 0.02 0.00)
        (0.02 0.02 0.00)
        (0.02 0.18 0.00)
        (0.01 0.18 0.00)
        (0.01 0.02 0.01)
        (0.02 0.02 0.01)
        (0.02 0.18 0.01)
        (0.01 0.18 0.01)

	//Block-4 right vertical channel
        (0.18 0.02 0.00)
        (0.19 0.02 0.00)
        (0.19 0.18 0.00)
        (0.18 0.18 0.00)
        (0.18 0.02 0.01)
        (0.19 0.02 0.01)
        (0.19 0.18 0.01)
        (0.18 0.18 0.01)

        //Block-5 upper horz 
        (0.01 0.18 0.00)
        (0.19 0.18 0.00)
        (0.19 0.19 0.00)
        (0.01 0.19 0.00)
        (0.01 0.18 0.01)
        (0.19 0.18 0.01)
        (0.19 0.19 0.01)
        (0.01 0.19 0.01)

	//Block-6 inlet
        (0.09 0.19 0.00)
        (0.11 0.19 0.00)
        (0.11 0.20 0.00)
        (0.09 0.20 0.00)
        (0.09 0.19 0.01)
        (0.11 0.19 0.01)
        (0.11 0.20 0.01)
        (0.09 0.20 0.01)
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) ( 20  10 1) simpleGrading (1 1 1)
    hex ( 8  9 10 11 12 13 14 15) (180  10 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) ( 10 160 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) ( 10 160 1) simpleGrading (1 1 1)
    hex (32 33 34 35 36 37 38 39) (180  10 1) simpleGrading (1 1 1)
    hex (40 41 42 43 44 45 46 47) ( 20  10 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (43 42 46 47)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 0 4 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            ( 2  1  5  6)
	    ( 0  3  7  4)
	    (40 43 47 44)
	    (42 41 45 46)
        );
    }

    intf_outer
    {
        type wall;
        faces
        (
            //( 9  8 12 13)
	    ( 8 11 15 12)
	    (10  9 13 14)
	    (16 19 23 20)
	    (26 25 29 30)
	    (32 35 39 36)
	    (34 33 37 38)
	    //(39 35 34 38)
        );
    }

    intf_outer1
    {
	type wall;
	faces
	(
	    (9 8 12 13)
	    (39 35 34 38)
	);
    }

    intf_outer1m
    {
	type wall;
	faces
	(
	    ( 3  2  6  7)
	    (41 40 44 45)
	);
    }

    intf_inner
    {
        type wall;
        faces
        (
            //(11 10 14 15)
	    (18 17 21 22)
	    (24 27 31 28)
	    //(32 36 37 33)
        );
    }

    intf_inner1
    {
        type wall;
        faces
        (
            (11 10 14 15)
            (32 36 37 33)
        );
    }

    intf_inner1m
    {
	type wall;
	faces
	(
	    (16 20 21 17)
	    (24 28 29 25)
	    (19 18 22 23)
	    (27 26 30 31)
	);
    }

    frontAndBack
    {
	type wall;
	faces
	(
	    ( 0  1  2  3)
	    ( 5  4  7  6)
	    ( 8  9 10 11)
	    (13 12 15 14)
	    (16 17 18 19)
	    (21 20 23 22)
	    (24 25 26 27)
	    (29 28 31 30)
	    (32 33 34 35)
	    (37 36 39 38)
	    (40 41 42 43)
	    (45 44 47 46)
	);
    }
);

mergePatchPairs
(
    (intf_outer1 intf_outer1m)
    (intf_inner1 intf_inner1m)
);
