tutorials/cem_toyARC_solidNodes/fluid-openfoam/0/phiE
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0.1;

boundaryField
{
    "(inlet|outlet|walls)"
    {
        type            zeroGradient;
    }
    "intf.*"
    {
	type		fixedValue;
	value		uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
